<?xml version="1.0" ?>
<net name="nn_inversek2j-2D" version="7">
	<layers>
		<layer id="0" name="conv2d_54_input" type="Input">
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>200</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv2d_54/Conv2D" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,2" output="8" pads_begin="0,0" pads_end="0,0" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>200</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" precision="FP16" size="32"/>
				<biases offset="32" precision="FP16" size="16"/>
			</blobs>
		</layer>
		<layer id="2" name="conv2d_54/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv2d_55/Conv2D" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="48" precision="FP16" size="32"/>
				<biases offset="80" precision="FP16" size="4"/>
			</blobs>
		</layer>
		<layer id="4" name="conv2d_55/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2020.1.0-61-gd349c3ba4a"/>
		<cli_parameters>
			<blobs_as_inputs value="True"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V2 value="False"/>
			<generate_deprecated_IR_V7 value="True"/>
			<generate_experimental_IR_V10 value="False"/>
			<input_model value="DIR/nn_inversek2j-2D.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,200,400,1]"/>
			<keep_quantize_ops_in_IR value="True"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="nn_inversek2j-2D"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="[  1 200 400   1]"/>
			<progress value="False"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, output, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
