<?xml version="1.0" ?>
<net name="scene_classification_layers-scaling-0.75" version="7">
	<layers>
		<layer id="0" name="conv2d_input" type="Input">
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv2d/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="5,5" output="36" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>36</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" precision="FP16" size="5400"/>
				<biases offset="5400" precision="FP16" size="72"/>
			</blobs>
		</layer>
		<layer id="2" name="conv2d/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>36</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv2d_1/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="36" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>36</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5472" precision="FP16" size="23328"/>
				<biases offset="28800" precision="FP16" size="72"/>
			</blobs>
		</layer>
		<layer id="4" name="conv2d_1/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>36</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="max_pooling2d/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>36</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv2d_2/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="5,5" output="24" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<weights offset="28872" precision="FP16" size="43200"/>
				<biases offset="72072" precision="FP16" size="48"/>
			</blobs>
		</layer>
		<layer id="7" name="conv2d_2/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv2d_3/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<weights offset="72120" precision="FP16" size="10368"/>
				<biases offset="82488" precision="FP16" size="48"/>
			</blobs>
		</layer>
		<layer id="9" name="conv2d_3/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="max_pooling2d_1/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv2d_4/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="5,5" output="18" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="82536" precision="FP16" size="21600"/>
				<biases offset="104136" precision="FP16" size="36"/>
			</blobs>
		</layer>
		<layer id="12" name="conv2d_4/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv2d_5/Conv2D" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="18" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="104172" precision="FP16" size="5832"/>
				<biases offset="110004" precision="FP16" size="36"/>
			</blobs>
		</layer>
		<layer id="14" name="conv2d_5/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="max_pooling2d_2/MaxPool" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="max_pooling2d_2/MaxPool/Transpose" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="flatten/Reshape/Cast_12054_const" type="Const">
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="110040" precision="I32" size="8"/>
			</blobs>
		</layer>
		<layer id="18" name="flatten/Reshape" type="Reshape">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>5832</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="dense/MatMul" type="FullyConnected">
			<data out-size="192"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5832</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
			<blobs>
				<weights offset="110048" precision="FP16" size="2239488"/>
				<biases offset="2349536" precision="FP16" size="384"/>
			</blobs>
		</layer>
		<layer id="20" name="dense/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="dense_1/MatMul" type="FullyConnected">
			<data out-size="96"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2349920" precision="FP16" size="36864"/>
				<biases offset="2386784" precision="FP16" size="192"/>
			</blobs>
		</layer>
		<layer id="22" name="dense_1/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="dense_2/MatMul" type="FullyConnected">
			<data out-size="48"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2386976" precision="FP16" size="9216"/>
				<biases offset="2396192" precision="FP16" size="96"/>
			</blobs>
		</layer>
		<layer id="24" name="dense_2/Relu" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="dense_3/MatMul" type="FullyConnected">
			<data out-size="6"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2396288" precision="FP16" size="576"/>
				<biases offset="2396864" precision="FP16" size="12"/>
			</blobs>
		</layer>
		<layer id="26" name="dense_3/Softmax" type="SoftMax">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="3" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="3" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="3" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="3" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="19" to-port="0"/>
		<edge from-layer="19" from-port="3" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="3" to-layer="22" to-port="0"/>
		<edge from-layer="22" from-port="1" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="3" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="3" to-layer="26" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2020.1.0-61-gd349c3ba4a"/>
		<cli_parameters>
			<blobs_as_inputs value="True"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V2 value="False"/>
			<generate_deprecated_IR_V7 value="True"/>
			<generate_experimental_IR_V10 value="False"/>
			<input_model value="DIR/scene_classification_layers-scaling-0.75.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,150,150,3]"/>
			<keep_quantize_ops_in_IR value="True"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="scene_classification_layers-scaling-0.75"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="[  1 150 150   3]"/>
			<progress value="False"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, output, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
